Actually even trying the default configuration from the terraform guide fails the same way:
```ini
resource "checkpoint_management_simple_cluster" "example" {
  name = "cluster1"
  color = "yellow"
  version = "R80.30"
  os_name = "Gaia"
  cluster_mode = "cluster-xl-ha"
  firewall = true
  ipv4_address = "17.23.5.1"
}
```

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.gateways.checkpoint_management_simple_cluster.example will be created
  + resource "checkpoint_management_simple_cluster" "example" {
      + cluster_mode      = "cluster-xl-ha"
      + color             = "yellow"
      + dynamic_ip        = (known after apply)
      + firewall          = true
      + hit_count         = true
      + id                = (known after apply)
      + ignore_errors     = false
      + ignore_warnings   = false
      + ips_update_policy = "gateway automatic update"
      + ipv4_address      = "17.23.5.1"
      + name              = "cluster1"
      + os_name           = "Gaia"
      + sic_name          = (known after apply)
      + sic_state         = (known after apply)
      + version           = "R80.30"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
module.gateways.checkpoint_management_simple_cluster.example: Creating...
╷
│ Error: Plugin did not respond
│ 
│   with module.gateways.checkpoint_management_simple_cluster.example,
│   on gateways/main.tf line 1, in resource "checkpoint_management_simple_cluster" "example":
│    1: resource "checkpoint_management_simple_cluster" "example" {
│ 
│ The plugin encountered an error, and failed to respond to the
│ plugin.(*GRPCProvider).ApplyResourceChange call. The plugin logs may
│ contain more details.
╵

Stack trace from the terraform-provider-checkpoint_v2.4.0 plugin:

panic: interface conversion: interface {} is string, not map[string]interface {}

goroutine 41 [running]:
github.com/CheckPointSW/terraform-provider-checkpoint/checkpoint.readManagementSimpleCluster(0xc00049d110, 0x13d4ea0, 0xc000b682d0, 0x3, 0xc00094c6e8)
	github.com/CheckPointSW/terraform-provider-checkpoint/checkpoint/resource_checkpoint_management_simple_cluster.go:2704 +0xca2d
github.com/CheckPointSW/terraform-provider-checkpoint/checkpoint.createManagementSimpleCluster(0xc00049d110, 0x13d4ea0, 0xc000b682d0, 0x2, 0x1ca6940)
	github.com/CheckPointSW/terraform-provider-checkpoint/checkpoint/resource_checkpoint_management_simple_cluster.go:2599 +0x55a5
github.com/hashicorp/terraform-plugin-sdk/helper/schema.(*Resource).Apply(0xc000274be0, 0xc0009485a0, 0xc000077dc0, 0x13d4ea0, 0xc000b682d0, 0x12ce501, 0xc000be61c8, 0xc000bb1d10)
	github.com/hashicorp/terraform-plugin-sdk@v1.17.0/helper/schema/resource.go:320 +0x375
github.com/hashicorp/terraform-plugin-sdk/helper/schema.(*Provider).Apply(0xc000168500, 0xc000d11a38, 0xc0009485a0, 0xc000077dc0, 0xc000a3f288, 0xc000957e60, 0x12d0620)
	github.com/hashicorp/terraform-plugin-sdk@v1.17.0/helper/schema/provider.go:294 +0x99
github.com/hashicorp/terraform-plugin-sdk/internal/helper/plugin.(*GRPCProviderServer).ApplyResourceChange(0xc00000f370, 0x[164](https://github.com/3M-Cloud/op-3mhealth-firewall-policies/actions/runs/4892794531/jobs/8734972169#step:14:165)3cf0, 0xc0005bd920, 0xc000488310, 0xc00000f370, 0xc0005bd920, 0xc000101ba0)
	github.com/hashicorp/terraform-plugin-sdk@v1.17.0/internal/helper/plugin/grpc_provider.go:895 +0x8a5
github.com/hashicorp/terraform-plugin-sdk/internal/tfplugin5._Provider_ApplyResourceChange_Handler(0x13b9c60, 0xc00000f370, 0x1643cf0, 0xc0005bd920, 0xc0005250e0, 0x0, 0x1643cf0, 0xc0005bd920, 0xc000601c00, 0x6b1)
	github.com/hashicorp/terraform-plugin-sdk@v1.17.0/internal/tfplugin5/tfplugin5.pb.go:3305 +0x214
google.golang.org/grpc.(*Server).processUnaryRPC(0xc0005fe1c0, 0x164ccf8, 0xc00052d800, 0xc000978500, 0xc0009469f0, 0x1c65820, 0x0, 0x0, 0x0)
	google.golang.org/grpc@v1.32.0/server.go:1194 +0x52b
google.golang.org/grpc.(*Server).handleStream(0xc0005fe1c0, 0x164ccf8, 0xc00052d800, 0xc000978500, 0x0)
	google.golang.org/grpc@v1.32.0/server.go:1517 +0xd0c
google.golang.org/grpc.(*Server).serveStreams.func1.2(0xc0002ac3d0, 0xc0005fe1c0, 0x164ccf8, 0xc00052d800, 0xc000978500)
	google.golang.org/grpc@v1.32.0/server.go:859 +0xab
created by google.golang.org/grpc.(*Server).serveStreams.func1
	google.golang.org/grpc@v1.32.0/server.go:857 +0x1fd

Error: The terraform-provider-checkpoint_v2.4.0 plugin crashed!

This is always indicative of a bug within the plugin. It would be immensely
helpful if you could report the crash with the plugin's maintainers so that it
can be fixed. The output above should help diagnose the issue.
```